Posting my workaround here that I showed @johngtam 

You just need to:
- Circumvent Terraform's circular resource dependency detection by manually constructing each other IAM role's ARN.
- Set 1 role's policy to something else, as an escape hatch for an initial apply (so AWS doesn't complain about circular dependency), and then follow up with a second apply to set the policy properly in-place.

**Code, which can remain static**
```
locals {
  role1_name = "role1"
  role2_name = "role2"

  role1_arn = "arn:aws:iam::${data.aws_caller_identity.current.account_id}:role/${local.role1_name}"
  role2_arn = "arn:aws:iam::${data.aws_caller_identity.current.account_id}:role/${local.role2_name}"
}

variable "bootstrap" {
  default = false
}

data "aws_caller_identity" "current" {}

# Role 1
data "aws_iam_policy_document" "role1_trust" {
  statement {
    actions = ["sts:AssumeRole"]
    principals {
      type        = "AWS"
      identifiers = [
        local.role2_arn
      ]
    }
  }
}

data "aws_iam_policy_document" "role1_bootstrap" {
  statement {
    actions = ["sts:AssumeRole"]
    principals {
      type        = "Service"
      identifiers = ["ec2.amazonaws.com"]
    }
  }
}

resource "aws_iam_role" "role1" {
  name = local.role1_name

  assume_role_policy = var.bootstrap ? data.aws_iam_policy_document.role1_bootstrap.json : data.aws_iam_policy_document.role1_trust.json
}

# Role 2
data "aws_iam_policy_document" "role2_trust" {
  statement {
    actions = ["sts:AssumeRole"]
    principals {
      type        = "AWS"
      identifiers = [
        local.role1_arn
      ]
    }
  }
}

resource "aws_iam_role" "role2" {
  name = local.role2_name

  assume_role_policy = data.aws_iam_policy_document.role2_trust.json
}
```

**First Apply**
```
$ TF_VAR_bootstrap=true terraform apply

Terraform will perform the following actions:

  # aws_iam_role.role1 will be created
  + resource "aws_iam_role" "role1" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "role1"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_iam_role.role2 will be created
  + resource "aws_iam_role" "role2" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::<ACCOUNT_ID>:role/role1"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "role2"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

**Second Apply**
```
$ terraform apply

Terraform will perform the following actions:

  # aws_iam_role.role1 will be updated in-place
  ~ resource "aws_iam_role" "role1" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          + AWS     = "arn:aws:iam::<ACCOUNT_ID>:role/role2"
                          - Service = "ec2.amazonaws.com" -> null
                        }
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "role1"
        name                  = "role1"
        tags                  = {}
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```